# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..Dispose Method
FabricationPartSizeMap Class See Also
---
Releases all resources used by the FabricationPartSizeMap
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace